RT-Thread/rt-thread/bsp/at32/libraries/AT32F402_405_Firmware_Library/drivers/src/at32f402_405_usart.c
  switch(flag)
  {
    case USART_CTSCF_FLAG:
      int_status = (flag_status)usart_x->ctrl3_bit.ctscfien;
      break;
    case USART_BFF_FLAG:
      int_status = (flag_status)usart_x->ctrl2_bit.bfien;
      break;
    case USART_TDBE_FLAG:
      int_status = (flag_status)usart_x->ctrl1_bit.tdbeien;
      break;
    case USART_TDC_FLAG:
      int_status = (flag_status)usart_x->ctrl1_bit.tdcien;
      break;
    case USART_RDBF_FLAG:
      int_status = (flag_status)usart_x->ctrl1_bit.rdbfien;
      break;
    case USART_ROERR_FLAG:
      int_status = (flag_status)(usart_x->ctrl1_bit.rdbfien || usart_x->ctrl3_bit.errien);
      break;
    case USART_IDLEF_FLAG:
      int_status = (flag_status)usart_x->ctrl1_bit.idleien;
      break;
    case USART_NERR_FLAG:
    case USART_FERR_FLAG:
      int_status = (flag_status)usart_x->ctrl3_bit.errien;
      break;
    case USART_PERR_FLAG:
      int_status = (flag_status)usart_x->ctrl1_bit.perrien;
      break;
    case USART_RTODF_FLAG:
      int_status = (flag_status)usart_x->ctrl1_bit.retodie;
      break;
    case USART_CMDF_FLAG:
      int_status = (flag_status)usart_x->ctrl1_bit.cmdie;
      break;
    default:
      int_status = RESET;
      break;
  }

  if(int_status != SET)
  {
    return RESET;
  }

  if(usart_x->sts & flag)
  {
    return SET;
  }
  else
  {
    return RESET;
  }
}


/**
  * @brief  clear the usart's pending flags.
  * @param  usart_x: select the usart or the uart peripheral.
  *         this parameter can be one of the following values:
  *         USART1, USART2, USART3, USART4, USART5, USART6, UART7 or UART8.
  * @param  flag: specifies the flag to clear.
  *         this parameter can be any combination of the following values:
  *         - USART_CMDF_FLAG:   character match detection flag
  *         - USART_RTODF_FLAG:  receiver time out detection flag
  *         - USART_CTSCF_FLAG: (not available for USART5,USART6,UART7 and UART8).
  *         - USART_BFF_FLAG:
  *         - USART_TDC_FLAG:
  *         - USART_RDBF_FLAG:
  *         - USART_PERR_FLAG:
  *         - USART_FERR_FLAG:
  *         - USART_NERR_FLAG:
  *         - USART_ROERR_FLAG:
  *         - USART_IDLEF_FLAG:
  * @note
  *         - USART_PERR_FLAG, USART_FERR_FLAG, USART_NERR_FLAG, USART_ROERR_FLAG and USART_IDLEF_FLAG are cleared by software
  *           sequence: a read operation to usart sts register (usart_flag_get())
  *           followed by a read operation to usart dt register (usart_data_receive()).
  *         - USART_RDBF_FLAG can be also cleared by a read to the usart dt register(usart_data_receive()).
  *         - USART_TDC_FLAG can be also cleared by software sequence: a read operation to usart sts register (usart_flag_get())
  *           followed by a write operation to usart dt register (usart_data_transmit()).
  *         - USART_TDBE_FLAG is cleared only by a write to the usart dt register(usart_data_transmit()).
  * @retval none
  */
void usart_flag_clear(usart_type* usart_x, uint32_t flag)
{
  if(USART_RTODF_FLAG == flag)
  {
    usart_x->ifc = USART_RTODF_FLAG;
  }
  else if(USART_CMDF_FLAG == flag)
  {
    usart_x->ifc = USART_CMDF_FLAG;
  }
  else if(flag & (USART_PERR_FLAG | USART_FERR_FLAG | USART_NERR_FLAG | USART_ROERR_FLAG | USART_IDLEF_FLAG))
  {
    usart_x->sts;
    usart_x->dt;
  }
  else
  {
    usart_x->sts = ~flag;
  }
}

/**
  * @brief  configure the usart's rs485 transmit delay time.
  * @param  usart_x: select the usart or the uart peripheral.
  *         this parameter can be one of the following values:
  *         USART1, USART2, USART3
  * @param  start_delay_time: transmit start delay time.
  * @param  complete_delay_time: transmit complete delay time.
  * @retval none
  */
void usart_rs485_delay_time_config(usart_type* usart_x, uint8_t start_delay_time, uint8_t complete_delay_time)
{
  usart_x->ctrl1_bit.tsdt = start_delay_time;
  usart_x->ctrl1_bit.tcdt = complete_delay_time;
}

/**
  * @brief  swap the usart's transmit receive pin.
  * @param  usart_x: select the usart or the uart peripheral.
  *         this parameter can be one of the following values:
  *         USART1, USART2, USART3, UART4, UART5, USART6, UART7,or UART8.
  * @param  new_state: new state of the usart peripheral.
  *         this parameter can be: TRUE or FALSE.
  * @retval none
  */
void usart_transmit_receive_pin_swap(usart_type* usart_x, confirm_state new_state)
{
  usart_x->ctrl2_bit.trpswap = new_state;
}

/**
  * @brief  set the usart's identification bit num.
  * @param  usart_x: select the usart or the uart peripheral.
  *         this parameter can be one of the following values:
  *         USART1, USART2, USART3, UART4, UART5, USART6, UART7,or UART8.
  * @param  id_bit_num: the usart wakeup identification bit num.
  *         this parameter can be: USART_ID_FIXED_4_BIT or USART_ID_RELATED_DATA_BIT.
  * @retval none
  */
void usart_id_bit_num_set(usart_type* usart_x, usart_identification_bit_num_type id_bit_num)
{
  usart_x->ctrl2_bit.idbn = (uint8_t)id_bit_num;
}

/**
  * @brief  set the usart's de polarity.
  * @param  usart_x: select the usart or the uart peripheral.
  *         this parameter can be one of the following values:
  *         USART1, USART2, USART3
  * @param  de_polarity: the usart de polarity selection.
  *         this parameter can be: USART_DE_POLARITY_HIGH or USART_DE_POLARITY_LOW.
  * @retval none
  */
void usart_de_polarity_set(usart_type* usart_x, usart_de_polarity_type de_polarity)
{
  usart_x->ctrl3_bit.dep = (uint8_t)de_polarity;
}

/**
  * @brief  enable or disable the usart's rs485 mode.
  * @param  usart_x: select the usart or the uart peripheral.
  *         this parameter can be one of the following values:
  *         USART1, USART2, USART3
  * @param  new_state: new state of the irda mode.
  *         this parameter can be: TRUE or FALSE.
  * @retval none
  */
void usart_rs485_mode_enable(usart_type* usart_x, confirm_state new_state)
{
  usart_x->ctrl3_bit.rs485en = new_state;
}

/**
  * @brief  enable or disable the usart's most significant bit transmit first.
  * @param  usart_x: select the usart or the uart peripheral.
  *         this parameter can be one of the following values:
  *         USART1, USART2, USART3, USART4, USART5, USART6, UART7 and UART8.
  * @param  new_state: new state of the irda mode.
  *         this parameter can be: TRUE or FALSE.
  * @retval none
  */
void usart_msb_transmit_first_enable(usart_type* usart_x, confirm_state new_state)
{
  usart_x->ctrl2_bit.mtf = new_state;
}

/**
  * @brief  enable or disable the usart's dt register polarity reverse.
  * @param  usart_x: select the usart or the uart peripheral.
  *         this parameter can be one of the following values:
  *         USART1, USART2, USART3, USART4, USART5, USART6, UART7 and UART8.
  * @param  new_state: new state of the irda mode.
  *         this parameter can be: TRUE or FALSE.
  * @retval none
  */
void usart_dt_polarity_reverse(usart_type* usart_x, confirm_state new_state)
{
  usart_x->ctrl2_bit.dtrev = new_state;
}

/**
  * @brief  enable or disable the usart's tx pin polarity reverse.
  * @param  usart_x: select the usart or the uart peripheral.
  *         this parameter can be one of the following values:
  *         USART1, USART2, USART3, USART4, USART5, USART6, UART7 and UART8.
  * @param  new_state: new state of the irda mode.
  *         this parameter can be: TRUE or FALSE.
  * @retval none
  */
void usart_transmit_pin_polarity_reverse(usart_type* usart_x, confirm_state new_state)
{
  usart_x->ctrl2_bit.txrev = new_state;
}

/**
  * @brief  enable or disable the usart's rx pin polarity reverse.
  * @param  usart_x: select the usart or the uart peripheral.
  *         this parameter can be one of the following values:
  *         USART1, USART2, USART3, USART4, USART5, USART6, UART7 and UART8.
  * @param  new_state: new state of the irda mode.
  *         this parameter can be: TRUE or FALSE.
  * @retval none
  */
void usart_receive_pin_polarity_reverse(usart_type* usart_x, confirm_state new_state)
{
  usart_x->ctrl2_bit.rxrev = new_state;
}

/**
  * @brief  enable or disable the usart's receiver timeout detection enable.
  * @param  usart_x: select the usart or the uart peripheral.
  *         this parameter can be one of the following values:
  *         USART1, USART2, USART3, USART4, USART5, USART6, UART7 and UART8.
  * @param  new_state: new state of the irda mode.
  *         this parameter can be: TRUE or FALSE.
  * @retval none
  */
void usart_receiver_timeout_detection_enable(usart_type* usart_x, confirm_state new_state)
{
  usart_x->ctrl1_bit.rtoden = new_state;
}

/**
  * @brief  config the usart receiver timeout value.
  * @param  usart_x: select the usart or the uart peripheral.
  *         this parameter can be one of the following values:
  *         USART1, USART2, USART3, USART4, USART5, USART6, UART7 and UART8.
  * @param  new_state: new state of the irda mode.
  *         this parameter can be: TRUE or FALSE.
  * @retval none
  */
void usart_receiver_timeout_value_set(usart_type* usart_x, uint32_t value)
{
  usart_x->rtov_bit.rtov = value;
}

/**
  * @}
  */

#endif

/**
  * @}
  */

/**
  * @}
  */
